namespace eVybir.Infra
{
    public static class IdentityResolver
    {
        private static readonly List<string> Dataset = 
        [
            "Макаров Михайло Сергійович",
            "Іваненко Олександр Петрович",
            "Шевченко Марія Іванівна",
            "Ковальчук Андрій Миколайович",
            "Бондаренко Олена Сергіївна",
            "Ткаченко Дмитро Олегович",
            "Мельник Наталія Василівна",
            "Поліщук Віктор Анатолійович",
            "Кравченко Ірина Володимирівна",
            "Мороз Юрій Степанович",
            "Романюк Світлана Петрівна",
            "Лисенко Богдан Романович",
            "Савчук Оксана Михайлівна",
            "Гриценко Павло Денисович",
            "Дяченко Тетяна Олексіївна",
            "Зінченко Артем Віталійович",
            "Петренко Лариса Ігорівна",
            "Яремчук Максим Євгенович",
            "Федоренко Алла Борисівна",
            "Козак Сергій Андрійович",
            "Левченко Юлія Олександрівна",
            "Сидорчук Роман Ілліч",
            "Бойко Катерина Валеріївна",
            "Олійник Володимир Микитович",
            "Панасюк Ніна Семенівна",
            "Черненко Денис Олександрович",
            "Марчук Галина Ярославівна",
            "Костюк Ігор Петрович",
            "Гаврилюк Людмила Андріївна",
            "Паламарчук Олексій Тарасович",
            "Руденко Вікторія Леонідівна",
            "Довженко Тарас Богданович",
            "Нечипорук Ольга Вікторівна",
            "Степанюк Михайло Орестович",
            "Кириленко Інна Миколаївна",
            "Чумак Євген Павлович",
            "Сорока Валентина Федорівна",
            "Голуб Назар Святославович",
            "Вовк Марина Ростиславівна",
            "Приходько Антон Ігорович",
            "Климчук Олеся Дмитрівна",
            "Балюк Ростислав Юрійович",
            "Таран Аліна В’ячеславівна",
            "Онищенко Вадим Аркадійович",
            "Білан Христина Миронівна",
            "Пиріг Микита Русланович",
            "Стахів Софія Олегівна",
            "Жук Валерій Анатолійович",
            "Мазур Дарина Сергіївна",
            "Харченко Олександр Тимофійович",
            "Кучер Яна Денисівна"
        ];

        public static string ResolveName(int id)
        {
            var datasetId = id - 1;
            if(datasetId < Dataset.Count) return Dataset[datasetId];
            return Dataset[Random.Shared.Next(Dataset.Count)];
        }

        public static int ResolveAge(int id) => Random.Shared.Next(18, 60);
    }
}
